# Швед Даниил, 1 вариант
books = [
    {"Название": "Гарри Поттер", "год": "1997", "автор": "Дж. К. Роулинг"},
    {"Название": "Властелин Колец", "год": "1954", "автор": "Дж. Р. Р. Толкин"},
    {"Название": "Преступление и наказание", "год": "1866", "автор": "Ф. М. Достоевский"},
    {"Название": "Мастер и Маргарита", "год": "1966", "автор": "М. А. Булгаков"},
    {"Название": "Три товарища", "год": "1936", "автор": "Эрих Мария Ремарк"}
]
j = 0
for i in books:
    print(f"-----------------------------Книга {j + 1}-------------------------")
    print(f"Название: {i["Название"]}, Автор: {i["автор"]}")
    print(f"------------------------------{i["год"]}---------------------------")
    j = j+1
